# С помощью КИХ ФНЧ, коэффициенты которого хранятся в текстовом файле
# 'FIR_LPF_Fco=1.5kHz_Fsamp=8kHz.txt', очистить от
# высокочастотных шумов реализацию {x_i} из 'xi_9.txt'”'.
# Частота дискретизации сигнала 8 кГц. Отобразить исходную – {x_i}  и
# отфильтрованную – {y_i} реализации на одном графике. Оценить и отобразить
# графически в логарифмическом масштабе спектры мощности реализаций {x_i} , {y_i} i y .
# Рассчитать и отобразить на графиках в логарифмическом и линейном масштабах
# АЧХ используемого фильтра.