# Передаточная функция цифрового фильтра имеет вид: 
#     H(z)=0.01*z**9+0.03*z**8+0.09*z**7+0.20*z**6+0.20*z**5+0.20*z**4+0.20*z**3+0.20*z**4+0.20*z**3+0.09*z**2+0.03*z**1+0.01 / z**9
# Рассчитать методом деления в столбик и отобразить графически 1000 значений
# импульсной характеристики. Рассчитать и изобразить графически АЧХ этого
# фильтра в линейном масштабе. К какому классу относится линейная система,
# имеющая такую передаточную характеристику? Какой тип у анализируемого
# фильтра? Какая частота среза?