# Запрограммировать метод оценки спектров Уэлча, оформив алгоритм в виде
# процедуры.
# На входе подпрограммы: массив данных, его длина, ширина окна, используемого
# при расчете периодограмм, сдвиг окна, используемого при расчете периодограмм,
# целочисленный код, определяющий тип оконного преобразования.
# На выходе подпрограммы: массив, содержащий оценку спектра мощности входного
# временного ряда, сделанную методом Уэлча.
# При реализации метода можно использовать подпрограммы, осуществляющие ДПФ
# (п. 3.1) и оконное преобразование сигнала (п. 4.3).