# Из-за несоблюдения особенностей технологического процесса внутри 
# объемной стальной детали образовался дефект. 
# Излучатель ультразвукового дефектоскопа генерирует гармонические импульсы с частотой 5 МГц. 
# Тестирующий сигнал отражается от дефекта и регистрируется приемником дефектоскопа. 
# Излученный и принятый сигнал были оцифрованы с частотой дискретизации 100 МГц 
# и сохранены в файлы 
# “Практическое занятие 2\Radar data\UStransmitter.txt” и “Практическое занятие 2\Radar data\USreceiver.txt” 
# (принятый после отражения от дефекта сигнал значительно затух и зашумлен) соответственно. 
# Необходимо определить, на какой глубине, расположен дефект, полагая, 
# что скорость звука в стали используемой марки 5 км/c.  