# При использовании современных диагностических показателей состояния сердечнососудистой системы 
# человека важно корректно идентифицировать моменты R-пиков (высокоамплитудных короткие положительные
#  зубцы при регистрации кардиосигнала во II стандартном отведении) электрокардиограммы (ЭКГ). 
# Одним из методов решения этой задачи является сопоставление в скользящем окне участка 
# исследуемого сигнала с участком «эталонной» ЭКГ с помощью расчета ККФ.  
# В задаче требуется осуществить поиск R-пиков временного ряда ЭКГ участком с помощью оценки 
# в скользящем окне ККФ этого ряда и «эталонной» записи одного предварительно выбранного кардиокомплекса 
# здорового человека “ECG_sample_R.txt”. 
# Отобразить  графически результаты обработки, построив временной ряд ЭКГ с помеченными вершинами 
# Rпиков и рассчитываемую в скользящем окне величину ККФ. \
